In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv', nrows=6729)
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

In [3]:
internet_df = pd.read_csv('../data/internet_use.csv', nrows=4495)
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

In [4]:
gdp_df.shape

(6729, 4)

In [5]:
internet_df.shape

(4495, 4)

In [6]:
type(gdp_df.columns)

pandas.core.indexes.base.Index

In [7]:
type(internet_df.columns)

pandas.core.indexes.base.Index

In [8]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6719        Zimbabwe  1999  3054.064189              NaN
6720        Zimbabwe  1998  3099.076182              NaN
6721        Zimbabwe  1997  3036.422224              NaN
6722        Zimbabwe  1996  2985.856605              NaN
6723        Zimbabwe  1995  2736.486436              NaN
6724        Zimbabwe  1994  2768.309953              NaN
6725        Zimbabwe  1993  2572.870395              NaN
6726        Zimbabwe  1992  2591.007534              NaN
6727        Zimbabwe  1991  2906.272849              NaN
6728        Zimbabwe  1990  2819.549467              NaN

In [9]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [10]:

gdp_df = gdp_df.drop(columns = ['Value Footnotes'])

In [11]:
internet_df = internet_df.drop(columns = ['Value Footnotes'])

In [12]:
gdp_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

In [13]:
internet_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

In [14]:
gdp_df.columns = (['Country', 'Year', 'GDP_Per_Capita'])
gdp_df.head(2)

       Country  Year  GDP_Per_Capita
0  Afghanistan  2018     1734.723214
1  Afghanistan  2017     1758.465636

In [15]:
## ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [16]:
internet_df.columns = (['Country', 'Year', 'Internet_Users_Pct'])
internet_df.head(2)

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014                6.39
1  Afghanistan  2013                5.90

In [17]:
gdp_and_internet_use = pd.merge(gdp_df, internet_df, on = ['Country', 'Year'], how ='outer')
gdp_and_internet_use.head(5)

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     1734.723214                 NaN
1  Afghanistan  2017     1758.465636                 NaN
2  Afghanistan  2016     1757.023490                 NaN
3  Afghanistan  2015     1766.593077                 NaN
4  Afghanistan  2014     1795.735834                6.39

In [18]:
## schools_with_scores = pd.merge(schools_subset, indicators_subset, left_on = 'name', right_on = 'school_name', how = 'inner')
## schools_with_scores.head(3)

In [19]:
gdp_and_internet_use.tail(5)

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
7700  Virgin Islands (U.S.)  1997             NaN            6.948369
7701  Virgin Islands (U.S.)  1996             NaN            4.647186
7702  Virgin Islands (U.S.)  1995             NaN            2.801958
7703  Virgin Islands (U.S.)  1994             NaN            0.940645
7704  Virgin Islands (U.S.)  1990             NaN            0.000000

In [20]:
## 13. Subset the combined data frame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly

In [21]:
## surveys_df[surveys_df.year != 2002]

In [28]:
years_list = ['2004', '2009', '2014']
gdp_and_internet_use = gdp_and_internet_use.query("Year in @years_list")
print(gdp_and_internet_use.head())

        Country  Year  GDP_Per_Capita  Internet_Users_Pct
4   Afghanistan  2014     1795.735834            6.390000
9   Afghanistan  2009     1502.354073            3.550000
14  Afghanistan  2004     1025.208245            0.105809
21      Albania  2014    10700.993216           60.100000
26      Albania  2009     9525.377979           41.200000

In [29]:
gdp_and_internet_use.tail()

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
7668               Viet Nam  2009             NaN           26.550000
7673               Viet Nam  2004             NaN            7.642409
7683  Virgin Islands (U.S.)  2014             NaN           50.070000
7688  Virgin Islands (U.S.)  2009             NaN           27.396510
7693  Virgin Islands (U.S.)  2004             NaN           27.377009

In [30]:
## Create three new data frames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

In [33]:

gdp_and_internet_2004 = gdp_and_internet_use['Year'] == 2004
gdp_and_internet_2004 = gdp_and_internet_use[gdp_and_internet_2004]
print(gdp_and_internet_2004)
##gdp_and_internet_use = gdp_and_internet_use[gdp_and_internet_use_]big_sepals = iris_df[big_sepal_mask]

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
14              Afghanistan  2004     1025.208245            0.105809
31                  Albania  2004     7001.054082            2.420388
60                  Algeria  2004    11845.170512            4.634475
89                   Angola  2004     4604.657044            0.464815
118     Antigua and Barbuda  2004    21161.123532           24.266544
...                     ...   ...             ...                 ...
7551              Swaziland  2004             NaN            3.228685
7572                  Syria  2004             NaN            4.321594
7615     T.F.Y.R. Macedonia  2004             NaN           24.440000
7673               Viet Nam  2004             NaN            7.642409
7693  Virgin Islands (U.S.)  2004             NaN           27.377009

[278 rows x 4 columns]

In [34]:
gdp_and_internet_2009 = gdp_and_internet_use['Year'] == 2009
gdp_and_internet_2009 = gdp_and_internet_use[gdp_and_internet_2009]
print(gdp_and_internet_2009)

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
9               Afghanistan  2009     1502.354073             3.55000
26                  Albania  2009     9525.377979            41.20000
55                  Algeria  2009    12697.690780            11.23000
84                   Angola  2009     6292.534856             6.00000
113     Antigua and Barbuda  2009    22568.626530            42.00000
...                     ...   ...             ...                 ...
7546              Swaziland  2009             NaN             8.94000
7567                  Syria  2009             NaN            17.30000
7610     T.F.Y.R. Macedonia  2009             NaN            51.77000
7668               Viet Nam  2009             NaN            26.55000
7688  Virgin Islands (U.S.)  2009             NaN            27.39651

[279 rows x 4 columns]

In [35]:
gdp_and_internet_2014 = gdp_and_internet_use['Year'] == 2014
gdp_and_internet_2014 = gdp_and_internet_use[gdp_and_internet_2014]
print(gdp_and_internet_2014)

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
4               Afghanistan  2014     1795.735834                6.39
21                  Albania  2014    10700.993216               60.10
50                  Algeria  2014    13557.769757               18.09
79                   Angola  2014     6813.052106               21.26
108     Antigua and Barbuda  2014    20440.540555               64.00
...                     ...   ...             ...                 ...
7541              Swaziland  2014             NaN               27.10
7562                  Syria  2014             NaN               28.09
7605     T.F.Y.R. Macedonia  2014             NaN               68.06
7663               Viet Nam  2014             NaN               48.31
7683  Virgin Islands (U.S.)  2014             NaN               50.07

[278 rows x 4 columns]

In [36]:
	##Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab for auto-complete options).

In [ ]:
gdp_and_internet_2014